notes/dp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Dynamic Programming</title>
<!-- 2016-08-22 Mon 18:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="fraj" />
</head>
<body>
<div id="content">
<h1 class="title">Dynamic Programming</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Maximum Contiguous 1D Sub-Array</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2016-08-22 Mon 05:29]</span></span>
</p>
<ol class="org-ol">
<li>Maintain two sums: a running some - currentSum and a maximal sum - maxSum. Initalize them both to the first element of the array.
</li>
<li>Iterate over the array starting from the second element:
<ul class="org-ul">
<li>We have two choices to make here: add the element to the currentSum if adding it makes the currentSum greater. If however, adding the element
to the currentSum makes it lesser than it's existing value, update currentSum to this element (helps when currentSum is negative and
the element is non-negative)
</li>
<li>Update maxSum if currentSum exceeds the existing maxSum value.
</li>
</ul>
</li>
</ol>
</div>
<div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">Note #1</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
If the starting index and ending index of the elements of the subarray are to be found out, while updating the maxSum this information can be computed (the ending index is the current index of the element we're looking at in the array and the starting index will be the one we can save while taking a new element into consideration for currentSum in the previous step.
</p>
</div>
</div>

<div id="outline-container-sec-1-0-2" class="outline-4">
<h4 id="sec-1-0-2">Note #2</h4>
<div class="outline-text-4" id="text-1-0-2">
<p>
To find the subarray with the largest width, a slight modification needs to be made in the way we update currentSum. Update currentSum if
adding the new element makes it equal to or greater than it's existing value.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">currentSum</span> = N[0], <span style="color: #a0522d;">maxSum</span> = N[0], <span style="color: #a0522d;">bestFrom</span> = 0, <span style="color: #a0522d;">from</span> = 0, <span style="color: #a0522d;">to</span> = 0;
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 1; i &lt; <span style="color: #228b22;">n</span>; ++i) {
    <span style="color: #a020f0;">if</span> (currentSum + N[i] &gt; N[i]) { <span style="color: #b22222;">// </span><span style="color: #b22222;">change this to &gt;= for the largest width subarray</span>
        currentSum = currentSum + N[i];
    } <span style="color: #a020f0;">else</span> {
        from = i;
        currentSum = N[i];
    }
    <span style="color: #a020f0;">if</span> (currentSum &gt; maxSum) {
        to = i;
        bestFrom = from;
        maxSum = currentSum;
    }
}
print(bestFrom, to, maxSum);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fraj</p>
<p class="date">Created: 2016-08-22 Mon 18:29</p>
<p class="creator">Emacs 24.5.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
